# Data Consistency

In [1]:
# imprt libraries
import pandas as pd
import os
import numpy as np

In [2]:
# create path
path = r'C:\Users\kacie\Box\Personal\CareerFoundry\Data Immersion\Achievement 4\Jupyter Folders'

In [21]:
# load products table
df_prod = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'))

In [5]:
# load orders table
df_ord = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'))

In [7]:
# create a data frame
df_test = pd.DataFrame()

In [9]:
#create a mixed column
df_test['Mix'] = ['a', 'b', '1', 'True']

In [24]:
#create a count of null entries for products table
df_prod.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [25]:
#create a table of null entries for products
df_null = df_prod[df_prod['product_name'].isnull() == True]

In [31]:
df_null

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [33]:
# find median price for products table
df_prod['prices'].median()

7.1

In [47]:
#create products table that does not include null entries
df_prod_no_null=df_prod[df_prod['product_name'].isnull() == False]

In [48]:
df_prod_no_null.shape

(49677, 5)

In [39]:
df_prod.shape

(49693, 5)

In [49]:
# create table of duplicated rows from no null products table
df_dup = df_prod_no_null[df_prod_no_null.duplicated()]

In [41]:
df_dup

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [45]:
#create table of duplicated ids from no null products table
df_id_dup = df_prod_clean[df_prod_clean['product_id'].duplicated() == True]

In [46]:
df_id_dup

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
6800,6800,Sprouted Quinoa Flakes Baby Cereal,92,18,14.0
18459,18458,Ranger IPA,27,5,9.2
26521,26520,Cheese Shredded Sharp Cheddar Reduced Fat 2%,21,16,2.9
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [50]:
#remove duplcates from no null products table
df_prod_clean = df_prod_no_null.drop_duplicates()

In [51]:
df_prod_clean.shape

(49672, 5)

In [52]:
df_prod_no_null.shape

(49677, 5)

In [53]:
#save products table with no duplicates and no nulls
df_prod_clean.to_csv(os.path.join(path,'data','prepared data','products checked.csv'))

In [54]:
#4.5.2 find statistics on orders table
df_ord.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [56]:
df_ord.head()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [57]:
# 4.5.3 find mixed data columns in the orders table
for col in df_ord.columns.tolist():
  weird = (df_ord[[col]].applymap(type) != df_ord[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ord[weird]) > 0:
    print (col)

In [58]:
# 4.5.5 check for missing data in orders table
df_ord.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
order_day_of_week              0
order_hour                     0
days_since_prior_order    206209
dtype: int64

In [59]:
# 4.5.6 create new orders table that replaces mssing data in orders table with '0'
df_ord_fill = df_ord.fillna('0')

In [60]:
# check for missing data in new orders table 
df_ord_fill.isnull().sum()

Unnamed: 0                0
order_id                  0
user_id                   0
order_number              0
order_day_of_week         0
order_hour                0
days_since_prior_order    0
dtype: int64

In [67]:
# check new data type for orders table 
df_ord_fill['days_since_prior_order'].dtype

dtype('O')

In [68]:
# 4.5.6 change data type of 'days since prior order column'
df_ord_fill['days_since_prior_order']=df_ord_fill['days_since_prior_order'].astype('int64')

In [69]:
# recheck data type for orders table 
df_ord_fill['days_since_prior_order'].dtype

dtype('int64')

In [73]:
# 4.5.7 check for duplicates in the orders table
df_ord_dup = df_ord_fill[df_ord_fill.duplicated()]

In [74]:
df_ord_dup

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, order_day_of_week, order_hour, days_since_prior_order]
Index: []

In [75]:
# check for duplicate order id values in orders table
df_ord_id_dup = df_ord_fill[df_ord_fill['order_id'].duplicated()==True]

In [76]:
df_ord_id_dup

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, order_day_of_week, order_hour, days_since_prior_order]
Index: []

In [82]:
# save orders table
df_ord_fill.to_csv(os.path.join(path, 'data', 'prepared data', 'orders checked.csv'))